day11/01codeStreamBC/case/fillBox_BC/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  6                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1; //0.146;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 1)
    (1 0 1)
    (1 1 1)
    (0 1 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 50 50) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    wall leftWall
    (
        (0 4 7 3)
    )

    wall rightWall
    (
        (5 6 2 1)
    )

    wall frontWall
    (
        (4 7 6 5)
    )

    wall backWall
    (
        (3 2 1 0)
    )

    wall bottomWall
    (
        (0 1 5 4)
    )

    patch top
    (
        (7 3 2 6)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
